[{"description":"Create complete authentication system with login page. Mock authentication with two test users: Super Admin (email: admin@podoadmin.com, password: admin123) and Podiatrist (email: doctor@podoadmin.com, password: doctor123). Store authentication state in localStorage. Block all access to the system for unauthenticated users - show only the login page. Use white and very dark gray (almost black) color scheme for a professional medical aesthetic. The login page should be clean, professional and medical-focused.","type":"feature","passes":true,"id":1},{"description":"Implement complete internationalization (i18n) system with 4 languages: Spanish (default), English, Portuguese, and French. All UI text, labels, buttons, and messages must be translatable. Add language switcher in the header/navbar. Store language preference in localStorage. Create comprehensive translation files for all system modules.","type":"feature","passes":true,"id":2},{"description":"Create role-based access control system with two roles: Super Admin (full access to all features, credit management, user management, patient transfers, audit logs) and Podiatrist (patient management, clinical sessions, PDF printing, limited access). Show different navigation and features based on logged-in user role. Store role information with user session.","type":"feature","passes":true,"id":3},{"description":"Build main dashboard with sidebar navigation. Sidebar should include: Dashboard home, Credits management, Patients, Clinical Sessions, Settings (with theme customization). The layout should be responsive, professional, with the white and dark gray color scheme. Show user info and role in sidebar header. Add logout button.","type":"feature","passes":true,"id":4},{"description":"Implement credits management system. Create Credits Dashboard showing: monthly credits (auto-assigned, expire at end of cycle), extra credits (purchased, never expire but freeze on non-payment), credit consumption history, current balance, and credit purchase interface (mock). Credits are consumed only when generating clinical history JSON. Implement automatic credit reservation for 4 hours when starting a clinical session - release if not completed. Show credit balance prominently in the dashboard header.","type":"feature","passes":true,"id":5},{"description":"Build complete patient management module with: patient list view with search and filters, create new patient form (demographics, medical history, consent), edit patient details, view patient clinical history, patient profile page showing all sessions and data. Store all data in localStorage using structured JSON format. Patients must have unique IDs, creation timestamps, and audit trail.","type":"feature","passes":true,"id":6},{"description":"Implement clinical sessions management module. Each session must have: session date, clinical notes, anamnesis, physical examination, podiatric diagnosis, treatment plan, and up to 2 images in .webp format. Include image upload with automatic conversion from JPG/PNG to .webp (mock conversion for now). Sessions have draft and completed states - only draft sessions are editable. Link sessions to patients. Store as structured JSON in localStorage.","type":"feature","passes":true,"id":7},{"description":"Create JSON export functionality for clinical histories. Add export button in patient profile and session views. Export complete patient data including all sessions, images references, and audit metadata in structured JSON format. The JSON must include tenantId, patientId, timestamps, and complete medical data following the structure defined in the documentation. Provide download as .json file.","type":"feature","passes":true,"id":8},{"description":"Implement PDF printing functionality for clinical sessions and patient histories. Add print button that generates a formatted PDF document including patient demographics, session data, clinical notes, and images (converted to JPG/PNG for PDF compatibility). Include metadata footer with user, date, timestamp for traceability. Use a professional medical document layout. For now, use browser print functionality styled for PDF output.","type":"feature","passes":true,"id":9},{"description":"Create comprehensive theme customization system in Settings page. Include: Light/Dark mode toggle, Custom color picker for primary accent color (hex input), Preview of color changes in real-time, Save theme preferences to localStorage, Apply theme globally across all pages. The default light theme should use white background with very dark gray (almost black #1a1a1a) text. Dark theme should invert this professionally.","type":"feature","passes":true,"id":10},{"description":"Generate realistic test data and seed the localStorage database. Create: 2 users (Super Admin and Podiatrist as specified), 10-15 sample patients with complete demographics, 20-30 clinical sessions linked to patients with realistic clinical notes in Spanish, Mock credit transactions and balances (Super Admin: 1000 monthly + 500 extra credits, Podiatrist: 250 monthly + 50 extra credits), Sample audit logs. All data should follow the JSON structure from the documentation.","type":"feature","passes":true,"id":11}]
