[{"description": "Create complete authentication system with login page. Mock authentication with two test users: Super Admin (email: admin@podoadmin.com, password: admin123) and Podiatrist (email: doctor@podoadmin.com, password: doctor123). Store authentication state in localStorage. Block all access to the system for unauthenticated users - show only the login page. Use white and very dark gray (almost black) color scheme for a professional medical aesthetic. The login page should be clean, professional and medical-focused.", "type": "feature", "passes": true, "id": 1}, {"description": "Implement complete internationalization (i18n) system with 4 languages: Spanish (default), English, Portuguese, and French. All UI text, labels, buttons, and messages must be translatable. Add language switcher in the header/navbar. Store language preference in localStorage. Create comprehensive translation files for all system modules.", "type": "feature", "passes": true, "id": 2}, {"description": "Create role-based access control system with two roles: Super Admin (full access to all features, credit management, user management, patient transfers, audit logs) and Podiatrist (patient management, clinical sessions, PDF printing, limited access). Show different navigation and features based on logged-in user role. Store role information with user session.", "type": "feature", "passes": true, "id": 3}, {"description": "Build main dashboard with sidebar navigation. Sidebar should include: Dashboard home, Credits management, Patients, Clinical Sessions, Settings (with theme customization). The layout should be responsive, professional, with the white and dark gray color scheme. Show user info and role in sidebar header. Add logout button.", "type": "feature", "passes": true, "id": 4}, {"description": "Implement credits management system. Create Credits Dashboard showing: monthly credits (auto-assigned, expire at end of cycle), extra credits (purchased, never expire but freeze on non-payment), credit consumption history, current balance, and credit purchase interface (mock). Credits are consumed only when generating clinical history JSON. Implement automatic credit reservation for 4 hours when starting a clinical session - release if not completed. Show credit balance prominently in the dashboard header.", "type": "feature", "passes": true, "id": 5}, {"description": "Build complete patient management module with: patient list view with search and filters, create new patient form (demographics, medical history, consent), edit patient details, view patient clinical history, patient profile page showing all sessions and data. Store all data in localStorage using structured JSON format. Patients must have unique IDs, creation timestamps, and audit trail.", "type": "feature", "passes": true, "id": 6}, {"description": "Implement clinical sessions management module. Each session must have: session date, clinical notes, anamnesis, physical examination, podiatric diagnosis, treatment plan, and up to 2 images in .webp format. Include image upload with automatic conversion from JPG/PNG to .webp (mock conversion for now). Sessions have draft and completed states - only draft sessions are editable. Link sessions to patients. Store as structured JSON in localStorage.", "type": "feature", "passes": true, "id": 7}, {"description": "Create JSON export functionality for clinical histories. Add export button in patient profile and session views. Export complete patient data including all sessions, images references, and audit metadata in structured JSON format. The JSON must include tenantId, patientId, timestamps, and complete medical data following the structure defined in the documentation. Provide download as .json file.", "type": "feature", "passes": true, "id": 8}, {"description": "Implement PDF printing functionality for clinical sessions and patient histories. Add print button that generates a formatted PDF document including patient demographics, session data, clinical notes, and images (converted to JPG/PNG for PDF compatibility). Include metadata footer with user, date, timestamp for traceability. Use a professional medical document layout. For now, use browser print functionality styled for PDF output.", "type": "feature", "passes": true, "id": 9}, {"description": "Create comprehensive theme customization system in Settings page. Include: Light/Dark mode toggle, Custom color picker for primary accent color (hex input), Preview of color changes in real-time, Save theme preferences to localStorage, Apply theme globally across all pages. The default light theme should use white background with very dark gray (almost black #1a1a1a) text. Dark theme should invert this professionally.", "type": "feature", "passes": true, "id": 10}, {"description": "Generate realistic test data and seed the localStorage database. Create: 2 users (Super Admin and Podiatrist as specified), 10-15 sample patients with complete demographics, 20-30 clinical sessions linked to patients with realistic clinical notes in Spanish, Mock credit transactions and balances (Super Admin: 1000 monthly + 500 extra credits, Podiatrist: 250 monthly + 50 extra credits), Sample audit logs. All data should follow the JSON structure from the documentation.", "type": "feature", "passes": true, "id": 11}, {"description": "Completely restructure role-based navigation and access. Super Admin should NOT have access to Patients or Clinical Sessions - only Users Management, Credits Management (with Whop.io integration placeholder), and Settings. Remove patient-related navigation for Super Admin. Update seed data to include 4 user types: 1 Super Admin (admin@podoadmin.com/admin123), 1 Clinic Administrator (manager@clinic.com/manager123) who manages multiple podiatrists, 1 Admin (support@podoadmin.com/support123) with limited credit adjustment capabilities, and 3-4 Podiatrists (doctor1@clinic.com/doctor123, doctor2@clinic.com/doctor123, etc).", "type": "bug", "passes": true, "id": 12}, {"description": "Create Users Management module for Super Admin only. This should include: list all users (clinics and podiatrists) with filters, create new user/clinic, edit user details including role assignment, view complete user history and all their patients/sessions data, download complete user clinical history as JSON (export all patient data for a specific user), transfer/copy clinical history from one user to another user, add or subtract credits manually as administrative adjustment with reason field and audit trail, view credit transaction history per user. This is the core Super Admin dashboard.", "type": "feature", "passes": true, "id": 13}, {"description": "Create Clinic Administrator role and interface. Clinic Administrator is NOT a podiatrist - they manage a clinic with multiple podiatrists. Features: view list of all podiatrists in their clinic, view all patients across all their podiatrists, reassign patients from one podiatrist to another (use case: when podiatrist cannot attend appointments), view clinic-wide statistics and credit usage, manage podiatrist schedules, cannot create or edit clinical sessions themselves. Add navigation specific to this role.", "type": "feature", "passes": true, "id": 14}, {"description": "Create Admin role with limited credit adjustment capabilities. Admin users can only add credits to compensate for system errors, with a maximum limit of 10% of the user's total monthly credits per month. Include: credit adjustment interface with reason field (required), monthly limit tracker showing how much of the 10% has been used this month, adjustment history log, approval/audit trail. Admin cannot delete users, transfer data, or access clinical information beyond what's needed for credit adjustments.", "type": "feature", "passes": true, "id": 15}, {"description": "Make patient data fields immutable after creation. Once a patient is created, these fields must be locked and non-editable: name (first and last), date of birth, DNI/ID number, initial medical history, gender, and consent. Show these fields as read-only in edit forms with visual indication they cannot be changed. All other patient fields remain editable. Add clear UI indication (lock icon or disabled styling) for immutable fields.", "type": "bug", "passes": true, "id": 16}, {"description": "Remove JSON export functionality from Podiatrist and Clinic Administrator roles. Only Super Admin can download JSON files. Podiatrists and Clinic Administrators can only print PDFs of clinical sessions and patient histories. Remove export JSON buttons from patient and session views for non-Super Admin users.", "type": "bug", "passes": true, "id": 17}, {"description": "Remove theme customization options from Settings page. Eliminate: dark mode toggle, custom color picker (hex input), color preview system. Keep only: language selector, profile settings, and clinic logo upload (new feature). The system should have a single fixed light theme with white background and dark gray (#1a1a1a) text.", "type": "bug", "passes": true, "id": 18}, {"description": "Add clinic logo upload functionality in Settings page. Allow users to upload clinic or podiatrist logo image (PNG, JPG, SVG). Store logo in localStorage as base64 or file reference. Display uploaded logo in: Settings page preview, PDF printouts (top header), and optionally in the main dashboard header. Make logo updateable - users can change or remove it anytime. Include size validation (max 2MB) and preview before saving.", "type": "feature", "passes": true, "id": 19}, {"description": "Update patient list view filters. Add new filter options: email address search/filter and phone number search/filter. Remove DNI/ID number column from the main patient list table view. Keep DNI in the patient detail/profile view only. Make search work across name, email, and phone simultaneously for better UX.", "type": "bug", "passes": true, "id": 20}, {"description": "Integrate Whop.io placeholder for credit management in Super Admin dashboard. Add 'Connect to Whop.io' button/section in Credits Management page. Show placeholder UI for Whop.io integration status (mock for now - show as 'Not Connected' with setup instructions). Add explanatory text about Whop.io integration for automated credit purchases and subscription management. Include webhook URL placeholder and API key input fields (non-functional for now, ready for future implementation).", "type": "feature", "passes": true, "id": 21}, {"description": "Update PDF generation to include clinic logo. When printing patient history or clinical session PDFs, include the uploaded clinic logo in the header (top left or centered based on design). If no logo is uploaded, show clinic name as text. Ensure logo scales properly and doesn't break PDF layout. Logo should appear consistently across all PDF printouts.", "type": "feature", "passes": true, "id": 22}, {"description": "Create complete Users Management module for Super Admin. Build a dedicated Users page with: table showing all users/clinics with columns (name, email, role, clinic name, credits balance, status), search and filter by role/clinic/status, create new user button opening modal form (name, email, password, role selector, clinic assignment if applicable), edit user button to modify user details and role, view user profile showing complete information and all their patients, download user's complete clinical history as JSON button (exports all patient data for that user with proper structure), transfer clinical history feature - select source user and destination user to copy all patient/session data between users, manual credit adjustment interface with add/subtract buttons, amount input, reason text field (required), and confirmation dialog, credit transaction history table per user showing all adjustments with dates/reasons/who made them. This is the main Super Admin workspace.", "type": "feature", "passes": true, "id": 23}, {"description": "Build Clinic Administrator complete interface. Create Clinic Management page showing: list of all podiatrists in the clinic with their patient counts and schedules, all patients table across all clinic podiatrists with columns (patient name, email, phone, assigned podiatrist, last session date), patient reassignment feature - select patient(s) and choose new podiatrist from dropdown with confirmation dialog explaining use case (podiatrist absent/unavailable), clinic-wide statistics dashboard (total patients, sessions this month, credit usage, podiatrist activity), calendar view showing all podiatrist schedules, filter patients by assigned podiatrist. Clinic Administrator cannot create or edit clinical sessions - only view and manage assignments.", "type": "feature", "passes": true, "id": 24}, {"description": "Implement Admin role with credit adjustment limitations. Create Credit Adjustments page for Admin users showing: user selector dropdown to choose which user to adjust credits for, credit adjustment form with add/subtract toggle, amount input, required reason text field (minimum 20 characters), monthly limit display showing '10% Monthly Limit: X used of Y available this month', calculation of 10% based on user's total monthly credits, block adjustments if monthly limit exceeded with error message, adjustment history table with filters, approval workflow indicator (for future implementation). Include validation and clear error messages when limits are reached.", "type": "feature", "passes": true, "id": 25}, {"description": "Implement immutable patient fields after creation. In patient edit forms, make these fields completely read-only and visually distinct: firstName, lastName, dateOfBirth, dni (ID number), initialMedicalHistory, gender, consentGiven. Add lock icon next to each immutable field label. Use disabled input styling (gray background, no cursor). Add tooltip on hover explaining 'This field cannot be changed after patient creation for data integrity'. Allow editing of: contactEmail, phoneNumber, currentAddress, allergies, currentMedications, notes, and any other fields. Update validation to prevent immutable field changes even if someone tries via API/localStorage manipulation.", "type": "bug", "passes": true, "id": 26}, {"description": "Remove JSON export capability from non-Super Admin users. In patient profile and session detail pages, hide 'Export JSON' button if user role is not super_admin. Only show 'Print PDF' button for podiatrist, clinic_admin, and admin roles. Update permissions check to block JSON download API calls from non-super admin users. Keep JSON export functionality fully intact for Super Admin in Users Management page when downloading user clinical histories.", "type": "bug", "passes": true, "id": 27}, {"description": "Simplify Settings page - remove theme customization. Delete from Settings page: dark mode toggle switch, custom color picker/hex input, color preview components, theme selection dropdown, save theme preferences button. Keep only: language selector (4 languages), user profile settings (name, email, password change), and clinic logo upload section (new). Remove all theme-related state management and localStorage keys. System uses fixed light theme only with white background and #1a1a1a text.", "type": "bug", "passes": true, "id": 28}, {"description": "Add clinic logo upload to Settings page. Create Logo Management section with: current logo preview (show placeholder if none uploaded), file upload input accepting PNG, JPG, JPEG, SVG formats, file size validation (max 2MB) with error message, image preview before saving, save/update logo button storing image as base64 in localStorage under 'clinicLogo' key, remove logo button to clear it, aspect ratio guidance text (recommended 200x80px or similar logo dimensions). Logo should be accessible across the app for PDF generation and optional header display.", "type": "feature", "passes": true, "id": 29}, {"description": "Update patient list filters and columns. In Patients page table, remove DNI/ID column completely from the visible columns. Add filter inputs above the table: email address search field, phone number search field, patient name search field. Make search work across all three fields simultaneously (OR logic). Keep DNI visible only in patient detail/profile page, not in list view. Update table columns to show: Name, Email, Phone, Assigned Podiatrist, Last Visit, Status, Actions. Improve search UX with debounce on input.", "type": "bug", "passes": true, "id": 30}, {"description": "Add Whop.io integration placeholder in Credits Management. Create Whop Integration section in Super Admin Credits page with: connection status indicator showing 'Not Connected' with orange/yellow badge, 'Connect to Whop.io' primary button (mock action, show 'Coming Soon' toast), explanatory text: 'Integrate with Whop.io to automate credit purchases, subscription management, and payment processing for your clinics', configuration form fields (disabled/read-only for now): Webhook URL (show generated URL placeholder), API Key input field, Product ID input field, test connection button (disabled). Add help text explaining Whop.io benefits for automated billing.", "type": "feature", "passes": true, "id": 31}, {"description": "Update PDF generation to include clinic logo in header. Modify PDF print styles/templates for patient histories and clinical sessions to: check if clinic logo exists in localStorage, if logo exists, display it in PDF header (centered or top-left based on design), scale logo appropriately (max height 60px to not break layout), if no logo exists, show clinic name as text in header, ensure logo prints clearly in PDF output, test with and without logo to ensure layout doesn't break. Logo should appear consistently on all PDF printouts including patient summaries and session reports.", "type": "feature", "passes": true, "id": 32}, {"description": "Create comprehensive notifications system for podiatrists and clinic administrators. Build notification center with: bell icon in header showing unread count badge, dropdown panel listing recent notifications, notification types include patient reassignment (shows who transferred, who receives, who made the reassignment, timestamp), credit adjustments, upcoming appointments, and system alerts. Store notifications in localStorage with fields: id, userId (recipient), type, title, message, read status, timestamp, metadata (fromUser, toUser, patientName, etc). Add mark as read/unread functionality. Show notifications page with full history, filtering by type and read status. Auto-generate notification when Clinic Admin reassigns a patient - notify both the podiatrist losing the patient and the one receiving it.", "type": "feature", "passes": true, "id": 33}, {"description": "Build full calendar view page for podiatrists and clinic administrators. Create Calendar page with: monthly calendar grid showing current month with previous/next navigation, display all clinical sessions as events on their session dates, color-code sessions by status (completed, draft, cancelled), click on date to see all sessions for that day in a side panel, click on session to view details or edit, show session count badge on each date, today's date highlighted, upcoming appointments indicator, filter by podiatrist (for clinic admin view), week view and day view options. Use a calendar library or build custom calendar component. Link sessions to calendar automatically based on session date field.", "type": "feature", "passes": true, "id": 34}, {"description": "Implement appointment scheduling and follow-up reminder system in clinical sessions. Add these fields to clinical session form: nextAppointmentDate (date picker for suggested next visit), followUpNotes (text area for follow-up instructions), appointmentReason (dropdown: routine check-up, treatment continuation, post-procedure review, etc). In Sessions list page, add prominent alert banner showing: upcoming appointments in next 7 days with patient names and dates, overdue follow-ups (patients who should have returned but haven't), quick action buttons to schedule next session or contact patient. Add visual indicator (colored badge) on patient cards showing follow-up status: green (no follow-up needed), yellow (follow-up due soon within 7 days), red (overdue follow-up). Calculate follow-up status automatically based on nextAppointmentDate field.", "type": "feature", "passes": true, "id": 35}, {"description": "Add notifications bell icon component in main header/navbar. Position bell icon next to language selector and user profile. Show unread notification count as red badge on bell icon. On click, open dropdown panel showing last 5 notifications with: notification icon based on type, title and short message, timestamp (e.g., '2 hours ago'), read/unread visual indicator (dot or styling), mark as read button (checkmark icon), view all notifications link at bottom going to full notifications page. Dropdown should be dismissible by clicking outside. Update unread count in real-time when notifications are marked as read.", "type": "feature", "passes": true, "id": 36}, {"description": "Create dedicated Notifications page accessible from dropdown 'View All' link. Build full-page notifications list with: tabs for All, Unread, Read notifications, filter dropdown by notification type (reassignments, appointments, credits, system), search by patient name or content, table/list view showing: notification type icon, title, full message with details, timestamp, action buttons (mark read/unread, delete), bulk actions (mark all as read, delete selected), pagination for large notification lists. For reassignment notifications, show detailed info: Patient: [name], From: [previous podiatrist], To: [new podiatrist], Reassigned by: [clinic admin name], Reason: [if provided], Date: [timestamp].", "type": "feature", "passes": true, "id": 37}, {"description": "Update patient reassignment flow in Clinic Management page to generate notifications. When Clinic Administrator reassigns a patient: create notification for previous podiatrist with message 'Patient [name] has been reassigned from you to Dr. [new podiatrist] by [admin name]', create notification for new podiatrist with message 'Patient [name] has been assigned to you from Dr. [previous podiatrist] by [admin name]', optionally create notification for clinic admin as confirmation, store reassignment in audit log with full details, show success toast confirming notifications were sent. Include patient ID, previous/new podiatrist IDs, admin ID, reason (if applicable), and timestamp in notification metadata.", "type": "feature", "passes": true, "id": 38}, {"description": "Create messaging system for Super Admin to send notifications to users. Build Messages page accessible only to Super Admin with: recipient selector dropdown showing all users/clinics with option 'All Users', 'Select Specific Users' (checkboxes for multi-select), or 'Single User'. Message composition area with: subject/title field, message body textarea, send button, preview before sending. When message is sent, create notification for each recipient with type 'admin_message', title with subject, message with body, and metadata including: senderId, senderName, messageId, sentAt, subject. Track sent messages in a sent messages history view for Super Admin showing: recipients count, date sent, subject, read status count (how many read vs unread). Each user receives notification that appears in their notification bell and full notifications page. All 4 languages supported in message composition interface.", "type": "feature", "passes": true, "id": 39}, {"description": "Fix patient reassignment notifications to include all 3 recipients: manager, previous podiatrist, and new podiatrist. When Clinic Administrator reassigns a patient, create THREE notifications: 1) To the manager/clinic admin: 'You reassigned patient [name] from Dr. [previous] to Dr. [new]', 2) To previous podiatrist: 'Patient [name] has been reassigned from you to Dr. [new] by [admin name]', 3) To new podiatrist: 'Patient [name] has been assigned to you from Dr. [previous] by [admin name]'. All THREE must have identical metadata structure: patientId, patientName, fromUserId, fromUserName, toUserId, toUserName, reassignedById, reassignedByName, clinicAdminId, clinicAdminName, reassignmentDate. Ensure all 3 notifications are created in the same transaction.", "type": "bug", "passes": true, "id": 40}, {"description": "Implement clinic-based logo system. Update logo management so logos are stored per clinic/user: Super Admin and Clinic Administrators each have their own uploadable logo in Settings. When a podiatrist is part of a clinic (subaltern), they inherit and display their clinic's logo automatically - they CANNOT upload their own logo. Show read-only logo preview for podiatrists with text 'This logo belongs to [Clinic Name]'. In PDF generation, use the appropriate logo: for podiatrists, use their assigned clinic's logo; for independent users, use their own logo; for super admin, use configured system logo if any. Update logo storage to include clinicId or userId ownership field so pdfs and print statements show correct clinic branding.", "type": "feature", "passes": true, "id": 41}, {"description": "Ensure notification bell icon shows accurate unread count that updates in real-time. The red badge on the bell icon must display count of all unread notifications (type, doesn't matter - messages, reassignments, appointments, credits, all types). When a user marks a notification as read, the unread count decreases by 1 immediately. When any new notification arrives, the unread count increases by 1 immediately. The bell icon should update in the header without page refresh. Add listener to localStorage changes to trigger real-time updates. Verify all notification types increment the unread count: admin_messages, reassignments, appointments, credit_adjustments, system_alerts.", "type": "bug", "passes": true, "id": 42}, {"description": "Ensure admin messages from Super Admin appear prominently in notifications page. Admin messages should display with: sender name (Super Admin), subject as title, message body as description, timestamp, and read/unread status. Add formatting to make admin messages visually distinct (perhaps with a special background color or border). Verify that when a Super Admin sends a message to users, those users immediately see the notification in their bell icon AND in their Notifications page. Test by: logging in as different users and confirming messages appear in their notification list. Messages should NOT be filtered out by default - they should appear in 'All' tab automatically. If messages are not appearing, debug the addNotification function to ensure admin_message type is being saved correctly to localStorage.", "type": "bug", "passes": true, "id": 43}, {"description": "Verify and enhance notifications badge and display system. Ensure: 1) Red badge on bell icon shows unread notification count from ALL types (reassignment, appointment, credit, admin_message, system). Badge should display number > 99 as '99+'. 2) Bell icon dropdown shows last 5 notifications with proper icons and formatting for each type. 3) All notifications types are properly displayed in the dropdown with distinct visual styling: reassignment (blue), appointment (green), credit (yellow), admin_message (purple), system (gray). 4) Users can mark individual notifications as read from dropdown or mark all as read. 5) All notifications appear in full Notifications page when clicking 'View All'. Test by sending different notification types and verifying they appear in the badge count and dropdown.", "type": "bug", "passes": true, "id": 44}, {"description": "Verify and optimize the notification system is working correctly across all types and users. The badge counter on the bell icon should show the unread count from all notification types (reassignment, appointment, credit, admin_message, system) in red with white text. When users receive any type of notification, it should increment the badge count. When they mark notifications as read, the count should decrease. All notifications should be visible in the dropdown (last 5) and in the full Notifications page. Test by sending messages as Super Admin, creating reassignments as Clinic Admin, adjusting credits as Admin, and creating appointments/sessions as Podiatrist, then verify all notifications appear correctly with their respective type icons and styling.", "type": "bug", "passes": true, "id": 45}, {"description": "Implement proper clinic-based logo system with clinic ownership. Create a Clinic structure in storage with: clinicId (unique identifier), clinicName, ownerId (the clinic admin user who created it). Update the logo storage to be clinic-based: logos are stored with clinicId as the key, not userId. When a Clinic Admin uploads a logo, it's associated with their clinic. When Podiatrists who are subalterns of that clinic access the logo, they see and use the clinic's logo automatically. Create functions: saveClinicLogo(clinicId, logoData), getClinicLogo(clinicId), getLogoForUser(userId) - this function checks if user is a podiatrist with clinicId, if yes return clinic logo, if not return user's personal logo.", "type": "feature", "passes": true, "id": 46}, {"description": "Update Settings page logo upload UI based on user role and clinic membership. For Clinic Admin and independent doctors: show 'Upload Clinic/Professional Logo' section with upload button, current logo preview, update and delete buttons. For Podiatrist with clinicId (subaltern doctor): hide upload button, show read-only logo preview with message '[Clinic Name] Logo - This logo is shared by all doctors in this clinic. Contact your clinic administrator to change it.' For Super Admin and Admin roles: show nothing or a note that they don't have a clinic logo. Prevent podiatrist doctors from uploading their own logo - make the upload section read-only for them.", "type": "bug", "passes": true, "id": 47}, {"description": "Update PDF generation to use correct clinic logo based on user. Create logic in print function: if user is podiatrist with clinicId, retrieve clinic logo; if user is clinic admin or independent, retrieve user logo; if user is super admin/admin, show system branding. Test by: logging in as different podiatrists in same clinic and verifying they all see the same clinic logo in PDFs, then logging in as podiatrist in different clinic and verifying different logo appears, then logging in as independent doctor and verifying personal logo appears.", "type": "bug", "passes": true, "id": 48}, {"description": "Create clinic management data structure in localStorage. Store clinics with: clinicId, clinicName, ownerId (clinic admin), createdAt. Update seed data to include 2 clinics: Clinic 001 (owner: manager@clinic.com, doctors: doctor1, doctor2, doctor3), Clinic 002 (owner: different admin, doctor: doctor4). This ensures clinic relationships are properly tracked. Add function getClinicInfo(clinicId) to retrieve clinic details. Add function getUserClinic(userId) to find which clinic a user belongs to.", "type": "feature", "passes": true, "id": 49}, {"description": "Fix Settings page logo UI for proper role-based access control. Update settings-page.tsx: For clinic_admin role: show full logo management section with 'Upload/Update Clinic Logo' title, file upload input enabled, current logo preview, update and delete buttons all enabled. For podiatrist role WITH clinicId: show 'Clinic Logo' section (read-only), display current clinic logo in preview, show message in italics 'This logo belongs to [Clinic Name] and is shared by all doctors in this clinic. Contact your clinic administrator to make changes.' Hide all upload, update, delete buttons - input disabled. For podiatrist WITHOUT clinicId (independent): show message 'You are an independent professional. Clinics can assign a logo when you join them.' For super_admin and admin: show message 'Professional account - no clinic logo management needed.' Make sure the UI clearly distinguishes between editable and read-only states.", "type": "bug", "passes": true, "id": 50}, {"description": "Generate comprehensive seed data with 3 clinics, 3 podiatrists per clinic, 4 independent podiatrists, and realistic patient data. Create 3 clinics: 1) 'Clínica Podológica Premium' (clinic_001) with admin Maria Fernández, 2) 'Centro Médico Podológico' (clinic_002) with admin Juan García, 3) 'Podología Integral Plus' (clinic_003) with admin Sofia Rodríguez. For each clinic, assign 3 podiatrists. For 4 independent podiatrists without clinic assignment. For each podiatrist (clinic and independent), create 8-10 patients with realistic data (Spanish names, emails, phone numbers, dates of birth, DNI, medical histories). Create 15-20 clinical sessions per podiatrist with realistic dates (mix of past, today, future), clinical notes in Spanish, session types (consultation, treatment, follow-up), images references (mock .webp), and follow-up dates. Ensure all patients are properly linked to their respective podiatrists. Include some sessions that are completed and some in draft state.", "type": "feature", "passes": true, "id": 51}, {"description": "Add distinct logos for each of the 3 clinics in seed data. Generate or create 3 different colored/styled logo placeholders: Clinic 1 - Professional blue logo, Clinic 2 - Green health-focused logo, Clinic 3 - Red/burgundy clinical logo. Store these logos in each clinic's data so when podiatrists from each clinic print PDFs, their clinic's specific logo appears. Test by logging in as different podiatrists and verifying each clinic's doctors see their clinic's logo in PDFs, not shared across clinics.", "type": "feature", "passes": true, "id": 52}, {"description": "Add unique folio (medical record number) to each patient at creation time. Update Patient interface to include field: folio (string, unique identifier). When creating a patient, auto-generate folio in format: [CLINIC_CODE][YEAR][SEQUENTIAL_NUMBER] - example: 'PREM-2026-00001' for first patient in Clínica Premium. If patient is independent (no clinic), use format: 'IND-2026-00001'. Store folio permanently with patient - never changes. Display folio prominently in patient profile header. Include folio in all patient data exports and PDFs. Update seed data to generate folios for all existing patients with retroactive dates based on their creation date.", "type": "feature", "passes": true, "id": 53}, {"description": "Add clinic profile/configuration fields for clinic admins. In Settings page, create 'Clinic Information' section (only visible for clinic_admin role) with editable fields: Clinic Name (read-only, shown from clinic data), Phone Number (with validation), Email Address (with validation), Physical Address (street, city, postal code), License/Registration Number, Website (optional). Store this data in the Clinic model in localStorage. When podiatrists view settings, show this information as read-only in a 'Clinic Details' section. Super Admin can view but not edit clinic information.", "type": "feature", "passes": true, "id": 54}, {"description": "Update PDF generation to include complete clinic information and folio. When printing patient history or clinical session, include in the PDF header: Clinic Logo (if available), Clinic Name, Patient Folio (prominently displayed with label 'FOLIO:'), Clinic Phone, Clinic Email, Clinic Address. Format the header professionally with: logo on left (max 60px), clinic details on right, folio centered below. In the patient info section of PDF, display: Patient Name | Folio: [PREM-2026-00001]. Update print styles in sessions-page.tsx and create a PDF header component that reuses this format. Ensure folio is visible and clear in all PDFs.", "type": "feature", "passes": true, "id": 55}, {"description": "Create clinic data structure with all required fields in seed data. For each clinic, add: phone number, email, address (street, city, postal code), license/registration number. Update seed-data.ts to create comprehensive clinic information for all 3 clinics with realistic Spanish contact data. Store in clinics storage. Independent podiatrists don't have clinic information (no clinic data to display). When printing PDFs for independent doctors, show only their name/professional info or a placeholder, not clinic data.", "type": "feature", "passes": true, "id": 56}, {"description": "Fix clinic logo storage and persistence. Create a separate localStorage key for clinic logos: 'podoadmin_clinic_logos' which stores an object { clinicId: logoData }. Update functions: createSeparateLogo storage system in storage.ts with dedicated setClinicLogo(clinicId, logoData) and getClinicLogo(clinicId) functions that use the separate key, not embedded in clinic object. This prevents JSON serialization issues with large base64 images. Update settings-page.tsx to use these new functions for save/load. Ensure logos persist across page refreshes and are accessible from all accounts (both clinic admin and podiatrist subalterns seeing same logo). Add logic to clear logo preview after successful save. Verify in console that logo is being saved to localStorage with key 'podoadmin_clinic_logos'.", "type": "bug", "passes": true, "id": 57}, {"description": "Fix PDF logo retrieval to use proper getClinicLogo function. In sessions-page.tsx handlePrint function, replace direct clinic.logo access with getClinicLogo(user.clinicId) to retrieve logo from the separate storage key. This ensures the logo stored by clinic admin is properly retrieved for printing. Update the line: 'clinicLogo = clinic.logo;' to 'clinicLogo = user?.clinicId ? getClinicLogo(user.clinicId) : undefined;' Import getClinicLogo from storage.ts if not already imported. Also import getProfessionalLogo for independent doctors.", "type": "bug", "passes": true, "id": 58}, {"description": "Implement professional logo system for independent podiatrists. Create separate localStorage key 'podoadmin_professional_logos' for independent doctor logos. Add functions in storage.ts: setProfessionalLogo(userId, logoData) and getProfessionalLogo(userId). In settings-page.tsx, for podiatrists without clinicId (independent): show 'Upload Professional Logo' section (same as clinic admin but saves to their userId), can upload/update/delete their logo, only they can see/edit it (not shared). Update handlePrint in sessions-page.tsx to: if user has clinicId use getClinicLogo(), if no clinicId use getProfessionalLogo(user.id). This way each independent doctor has their own unique logo in PDFs.", "type": "feature", "passes": true, "id": 59}, {"description": "Make clinic logos visible to podiatrist subalterns in Settings page. In settings-page.tsx, for podiatrists with clinicId: load and display clinic logo on page load using useEffect that calls getClinicLogo(user.clinicId). The currentLogo state should populate with the clinic logo when page loads. Add useEffect dependency on user.clinicId and clinicId from clinic data. Verify that isPodiatristWithClinic condition correctly shows read-only logo section with: clinic logo preview, message 'This logo belongs to [Clinic Name]...', no upload buttons.", "type": "bug", "passes": true, "id": 60}, {"description": "Add professional consultorio information for independent podiatrists in Settings. Create 'Consultorio Information' section in settings-page.tsx (only visible for podiatrist without clinicId). Include editable fields: Professional Name (pre-filled with user name), Phone Number, Email Address, Physical Address, City, Postal Code, License/Registration Number, Professional License Number (cédula profesional or equivalent). Store this data in a new storage key 'podoadmin_professional_info' with structure { userId: { name, phone, email, address, city, postalCode, licenseNumber, professionalLicense } }. Create functions in storage.ts: saveProfessionalInfo(userId, data), getProfessionalInfo(userId). Display this info as read-only in clinic podiatrists' profile view.", "type": "feature", "passes": true, "id": 61}, {"description": "Create recipe/prescription printing functionality. Add new 'Prescriptions' page or tab in sessions detail. Include form to create prescriptions with: Patient name (auto-filled), Prescription date (auto-filled), Podiatrist name (auto-filled), Prescription text/recommendations (textarea), Medications/Treatments (textarea for listing recommendations), Next visit date (date picker), Additional notes. Add 'Print Recipe' button that generates PDF with: Header (logo + consultorio/clinic info), Patient data (name, DOB, DNI), Folio, Podiatrist info with license number, Prescription content, Signature line, Footer with date and clinic info. Store prescriptions in localStorage with: prescriptionId, sessionId, patientId, content, createdAt, createdBy.", "type": "feature", "passes": true, "id": 62}, {"description": "Add professional license field to podiatrist profile/settings. In settings-page.tsx, for all podiatrist roles (clinic and independent): add 'Professional License' field (editable) to store their individual license/cédula number. Store in 'podoadmin_professional_licenses' key with { userId: licenseNumber }. This is DIFFERENT from clinic's license - this is the individual doctor's license. For clinic podiatrists, this is required/mandatory field. Display license in: Settings page (editable for their own), Patient profile view (read-only), Session detail (read-only), Prescription/Recipe printouts. For clinic admins: view all their podiatrist's license numbers in clinic management page.", "type": "feature", "passes": true, "id": 63}, {"description": "Update PDF generation to include professional license. In handlePrint function in sessions-page.tsx: retrieve podiatrist's professional license using getProfessionalLicense(user.id), display in PDF header near podiatrist name. Update recipe PDF to prominently display: 'Lic. [License Number]' below podiatrist name. For clinic podiatrists, include both clinic license (in clinic header) and podiatrist license (in podiatrist section).", "type": "bug", "passes": true, "id": 64}, {"description": "Restrict professional information editing for clinic podiatrists (subalterns). In settings-page.tsx, for podiatrist with clinicId: remove the full 'Información del Consultorio' form section. Replace with 'Professional Credentials' section showing ONLY: Cédula Profesional (editable text field), Número de Registro (editable text field), all other fields (name, phone, email, address, city, postalCode) shown as read-only displaying clinic data from getClinicById(user.clinicId). Add note: 'The rest of your information is managed by your clinic administrator.' Store cédula and registro in separate keys: 'podoadmin_professional_credentials' with { userId: { cedula, registro } }. Create functions in storage.ts: saveProfessionalCredentials(userId, cedula, registro), getProfessionalCredentials(userId).", "type": "bug", "passes": true, "id": 65}, {"description": "Update recipe/prescription printing to use clinic credentials for subaltern podiatrists. When printing recipe for a podiatrist with clinicId: use their stored cedula and registro from getProfessionalCredentials(user.id) but show clinic name, phone, email, address from clinic data. For independent podiatrists: use all their consultorio information from getProfessionalInfo(user.id). Update handlePrintPrescription() in sessions-page.tsx to retrieve both clinic credentials and individual credentials appropriately.", "type": "bug", "passes": true, "id": 66}, {"description": "Ensure recipe/prescription section is visible and fully functional for all podiatrists (clinic and independent). In sessions-page.tsx detail modal, verify: 1) Prescriptions section is always visible when a session is selected (for all podiatrist roles), 2) 'Nueva receta' button is visible and clickable for all podiatrists, 3) List of existing prescriptions shows with full details (folio, date, medications), 4) Print button for each recipe is visible, 5) The prescription form modal opens without restrictions. Add role check to ensure only podiatrist role can access this feature (not clinic_admin, super_admin, admin). Test that recipes section appears for both clinic and independent podiatrists. Make sure prescriptions are saved correctly per session.", "type": "feature", "passes": true, "id": 67}, {"description": "Implement comprehensive audit logging for ALL system movements. Add addAuditLog calls to ALL critical operations: 1) Patient Management - savePatient(), updatePatient(), deletePatient() with entityType='patient', 2) Sessions - saveSession(), updateSession(), deleteSession() with entityType='session', 3) Prescriptions - savePrescription(), deletePrescription() with entityType='prescription', 4) Patient Reassignment (clinic-page.tsx) - log when patient is reassigned between podiatrists, include fromPodiatrist, toPodiatrist in details, 5) Credit Adjustments - manual credit add/subtract with reason and amount, 6) Messages - Super Admin messages sent with recipient count, 7) Professional Info Changes - updates to clinic info, professional credentials, professional logo changes, 8) Notifications - system notifications created, 9) Session Status Changes - when session marked as completed/draft. Every log must include: userId (who did it), userName (readable name), action (specific action name), entityType (patient/session/credit/reassignment/etc), entityId (ID of affected entity), details (JSON string with all relevant metadata), createdAt (timestamp). For reassignments specifically: details must include previousPodiatrist, newPodiatrist, patientName, patientId, reason if any.", "type": "feature", "passes": true, "id": 68}, {"description": "Create Audit Log viewer page accessible to Super Admin only. Build audit-log-page.tsx with: table showing all logs, columns: Timestamp, User, Action, Entity Type, Entity ID, Details, filters by User/Action/EntityType/Date range, search functionality, export audit logs as CSV or JSON, pagination for large log lists, read-only view. Include summary statistics: total logs, logs by action type, most active users, recent actions. The details column should be expandable to show full JSON details. Make it visually clear and professional for compliance/audit purposes.", "type": "feature", "passes": true, "id": 69}, {"description": "Move Settings from sidebar to header as gear icon next to notifications bell. Create new SettingsButton component that displays a gear icon (⚙️) next to the NotificationsBell in the header. When clicked, it navigates to /settings page or opens settings modal. The button should have same styling as NotificationsBell - gray rounded icon with hover effect. Add to main-layout.tsx header right side: place SettingsButton right after NotificationsBell and before Credits display. Make it accessible for ALL user roles. In sidebar.tsx, remove the Settings menu item from navigation (delete the settings entry from navItems). The Settings link should now ONLY be accessible from the gear icon in the header across all pages and all roles.", "type": "feature", "passes": true, "id": 70}, {"description": "Create SettingsButton component in /src/web/components/settings-button.tsx. Component should: display gear/cog icon (SVG), have className 'relative p-2 rounded-lg hover:bg-gray-100 transition-colors' for consistency with NotificationsBell, on click navigate to /settings page using useLocation or Link, show tooltip on hover 'Configuración' (or use t.settings.title), ensure icon is same size and color as notification bell (#1a1a1a color, 5 or 6 height/width). Use the same styling patterns as NotificationsBell for visual consistency.", "type": "feature", "passes": true, "id": 71}, {"description": "In messages-page.tsx at line 392, remove the text 'Vista previa' - change it to empty string. This is likely a button label or preview text that needs to be removed.", "type": "feature", "passes": true, "id": 72}, {"description": "In messages-page.tsx around line 388, delete/remove the button element. This appears to be a preview button or similar UI element that the user wants removed from the messages interface.", "type": "feature", "passes": true, "id": 73}, {"description": "Create persistent user storage system for new users created by Super Admin. Add to storage.ts: 1) New storage key 'podoadmin_created_users' for users created after initial seeding, 2) Function saveCreatedUser(user: User, password: string) that stores user with hashed/plain password in localStorage, 3) Function getCreatedUsers() to retrieve all created users, 4) Merge function that combines MOCK_USERS with created users in auth-context.tsx so login works with both original mock users and newly created users. When Super Admin creates a user, the user is saved to localStorage and immediately available for login.", "type": "feature", "passes": true, "id": 74}, {"description": "Fix handleCreateUser in users-page.tsx to actually save the user. Update the function to: 1) Call saveCreatedUser() from storage.ts with the userData and password, 2) Add success toast notification 'Usuario creado exitosamente', 3) Refresh the users list, 4) Generate proper userId if not provided, 5) Add audit log with all details. After saving, the user should be able to log in with their email and password immediately. Test by creating a user, logging out, and logging in with the new credentials.", "type": "feature", "passes": true, "id": 75}, {"description": "Update auth-context.tsx to load created users on initialization. In the auth context provider useEffect or when checking MOCK_USERS, load the created users from storage and merge them with MOCK_USERS array. This ensures that any user created via Super Admin interface is available for login. The getCreatedUsers() should be called every time to get fresh list of user credentials.", "type": "feature", "passes": true, "id": 76}, {"description": "Fix and enhance credits display in header. Update main-layout.tsx: 1) Fix NaN issue by ensuring totalCredits is always a number (0 if credits undefined), 2) Calculate percentage of monthly credits remaining: (credits.monthly / initialMonthlyCredits) * 100. For calculation, assume initial monthly credits based on role or use 250 as default, 3) Add color logic: Green if > 10% of monthly credits, Yellow if <= 10% and > 0, Red if 0 credits, 4) Update the credits display box styling with dynamic background colors: bg-green-100 text-green-700 (green), bg-yellow-100 text-yellow-700 (yellow), bg-red-100 text-red-700 (red), 5) Add icon color to match (green-600, yellow-600, red-600), 6) Show tooltip/title on hover with breakdown: 'Monthly: X / Extra: Y', 7) Make credits box clickable to navigate to /credits or /dashboard for more details. Display should always show valid numbers, never NaN.", "type": "feature", "passes": true, "id": 77}, {"description": "Fix credits display for all users. The issue is that getUserCredits returns default values but doesn't initialize them in storage. Update storage.ts getUserCredits function to: 1) Check if user credits exist in storage, 2) If not, create initial credits for that user based on their role/userId and SAVE them to storage immediately, 3) Return the saved credits. This ensures that all users get proper initialized credits that persist. Also ensure that when a user is created via Super Admin, their initial credits are automatically saved based on their role. Add automatic credit initialization in saveCreatedUser() function.", "type": "bug", "passes": true, "id": 78}, {"description": "Add automatic credit initialization for all users. Create function initializeUserCredits(userId, role) that creates initial credits based on role: Super Admin = 1000 monthly + 500 extra, Clinic Admin = 500 monthly + 200 extra, Admin (Support) = 300 monthly + 100 extra, Podiatrist = 250 monthly + 50 extra. Call this function in: 1) getUserCredits when user not found (auto-initialize and save), 2) saveCreatedUser when creating new users, 3) seed-data.ts for initial users. This ensures credits are always available and consistent.", "type": "feature", "passes": true, "id": 79}, {"description": "Initialize user credits on successful login. In auth-context.tsx login function, after setting the user: call initializeUserCredits(matchedUser.user.id, matchedUser.user.role) to ensure credits are created and saved when user logs in. Import initializeUserCredits from storage.ts. This ensures every time a user logs in, they have properly initialized credits in localStorage.", "type": "bug", "passes": true, "id": 80}, {"description": "Force credit initialization in MainLayout. In main-layout.tsx, add useEffect that runs when user changes: if user exists and user.id is valid, call initializeUserCredits(user.id, user.role) to ensure credits are initialized when component mounts or user changes. This is a safety check to ensure credits exist regardless of how the user accesses the app.", "type": "bug", "passes": true, "id": 81}]
